#include "pch.h"

#include "calendar.h"

MonthInfo month_info_2019[] = {
    { 31, eTue }, // 2019/01
    { 28, eFri }, // 2019/02
    { 31, eFri }, // 2019/03
    { 30, eMon }, // 2019/04
    { 31, eWed }, // 2019/05
    { 30, eSat }, // 2019/06
    { 31, eMon }, // 2019/07
    { 31, eThu }, // 2019/08
    { 30, eSun }, // 2019/09
    { 31, eTue }, // 2019/10
    { 30, eFri }, // 2019/11
    { 31, eSun }, // 2019/12
};

EventInfo event_info_2019[][ EVENT_ITEM_MAX ] = {
    { // 2019/1
        { 1, "元旦" },
        { 7, "七草の日" },
        { 14,"成人の日" },
        { EVENT_END,nullptr },
    },
    { // 2019/2
        { 3, "節分" },
        { 4, "立春" },
        { 11, "建国記念日" },
        { 14, "バレンタインデー" },
        { EVENT_END,nullptr },
    },
    { // 2019/3
        { 3, "ひな祭り" },
        { 4, "立春" },
        { 14, "ホワイトデー" },
        { 21, "春分の日" },
        { EVENT_END,nullptr },
    },
    { // 2019/4
        { 1, "エイプリルフール" },
        { 29, "昭和の日" },
        { EVENT_END,nullptr },
    },
    { // 2019/5
        { 1, "メーデー" },
        { 3, "憲法記念日" },
        { 4, "みどりの日" },
        { 5, "こどもの日" },
        { 6, "振替休日" },
        { EVENT_END,nullptr },
    },
    { // 2019/6
        { 1, "衣替え" },
        { EVENT_END,nullptr },
    },
    { // 2019/7
        { 7, "七夕" },
        { 15, "海の日" },
        { 17, "祇園祭" },
        { 25, "天神祭" },
        { EVENT_END,nullptr },
    },
    { // 2019/8
        { 11, "山の日" },
        { 12, "振替休日" },
        { 15, "終戦記念日" },
        { EVENT_END,nullptr },
    },
    { // 2019/9
        { 15, "月見" },
        { 16, "敬老の日" },
        { 23, "秋分の日" },
        { EVENT_END,nullptr },
    },
    { // 2019/10
        { 1, "衣替え月見" },
        { 14, "体育の日" },
        { 23, "秋分の日" },
        { EVENT_END,nullptr },
    },
    { // 2019/12
        { 23, "天皇誕生日？" },
        { 24, "クリスマスイブ" },
        { 25, "クリスマス" },
        { 31, "大晦日" },
        { EVENT_END,nullptr },
    },
};